<a href="https://colab.research.google.com/github/werowe/HypatiaAcademy/blob/master/class/2024_10_01_sqlite_kickoff.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

#SQL Lite 3


SQL Light is the world's most popular database.  It is designed to be very small.  It in in every iPhone and Android phone, for example.

It is an **RDBMS** relational database management system.

We can use Python to work with it.  But even with Python the way we work with it is with SQL.  Below we show some of the most common SQL commands.

Data is stored in **rows** and **columns**.

The [documentation is here](https://www.sqlite.org/lang.html)/


# So Many Databases

* Oracle--5th richest man.  1970s.  IBM. Larry Ellison.  SQL (structured query language).

* MySQL--free. (SQL)
* PostgreSQL--free. (SQL)

* MongoDB--JavaScript database.  JSON.

* Cassandra--Uber

* Google Big Table--Yahoo Hadoop.  

* Microsoft SQL Server---must pay

* Redis--data warehouse

* ElasticSearch--cybersecurity.  JSON.  Lucene.

* IBM DB2--IBM mainframe.  

* MariaDB--

In [1]:
# load SQL command line interepreter
# % magic commands
# ! meant bash command

%load_ext sql

In [4]:
!ls

sample_data  students.db

In [3]:
%sql sqlite:///students.db

A database **table** stores data in rows and columns.

Here we say:

* create a table called students
* integer, text, boolean, real
* primary key.  
* autoincrement.  random() is not always unique.  uuid4() is a very large number.  **autoincrement**

In [5]:


%%sql

CREATE TABLE students
  (
    studentnumber INTEGER PRIMARY KEY AUTOINCREMENT,
    studentname text,
    phonenumber text,
    email text,
    datecreated text
  );

 * sqlite:///students.db
Done.

[]

In [28]:
# insert

%%sql

INSERT INTO students (studentname, phonenumber, email, datecreated)
VALUES ('William Shakespeare',"555-1212", "will@globe.uk.com", strftime('%s', 'now'));

 * sqlite:///students.db
1 rows affected.

[]

In [26]:
%%sql


INSERT INTO students (studentname, phonenumber, email, datecreated)
VALUES ('Thomas Mann',"555-1212", "a@a.com", strftime('%s', 'now'));

 * sqlite:///students.db
1 rows affected.

[]

In [9]:
# list rows in table
%%sql

select email, studentnumber from students;

 * sqlite:///students.db
Done.

[('will@globe.uk.com', 1), ('a@a.com', 2)]

In [10]:
%%sql

select * from students;

 * sqlite:///students.db
Done.

[(1, 'William Shakespeare', '555-1212', 'will@globe.uk.com', '1727795894'),
 (2, 'Thomas Mann', '555-1212', 'a@a.com', '1727795925')]

In [11]:
# find by column value

%%sql

select * from students where email="a@a.com";

 * sqlite:///students.db
Done.

[(2, 'Thomas Mann', '555-1212', 'a@a.com', '1727795925')]

In [12]:
import sqlite3


# connect to the database students.db.  if it does not exist then create it

conn = sqlite3.connect("students.db")

# cursor is like a list of rows.  you go forward, backup, etc.

cursor = conn.cursor()

sql="select * from students";


# there is no assignment operator.  it operators on itself.
# in otherwords customer.execute() updates cursor

cursor.execute(sql)

In [13]:
# fetch it.  means go get it
# go get all rows

rows = cursor.fetchall()

In [14]:
type(rows)

list

In [15]:
for row in rows:
  print(row)

(1, 'William Shakespeare', '555-1212', 'will@globe.uk.com', '1727795894')
(2, 'Thomas Mann', '555-1212', 'a@a.com', '1727795925')

In [19]:
# parentheses

t=(1, 'William Shakespeare', '555-1212', 'will@globe.uk.com', '1727795894')

t[0], t[1]

(1, 'William Shakespeare')

In [18]:
for row in rows:
  print(row[1], " student number is ", row[0])

William Shakespeare  student number is  1
Thomas Mann  student number is  2

In [21]:
%%sql

delete from students;

 * sqlite:///students.db
2 rows affected.

[]

In [29]:
%%sql

select * from students;

 * sqlite:///students.db
Done.

[(3, 'Thomas Mann', '555-1212', 'a@a.com', '1727796684'),
 (4, 'Thomas Mann', '555-1212', 'a@a.com', '1727796687'),
 (5, 'Thomas Mann', '555-1212', 'a@a.com', '1727796690'),
 (6, 'William Shakespeare', '555-1212', 'will@globe.uk.com', '1727796694'),
 (7, 'William Shakespeare', '555-1212', 'will@globe.uk.com', '1727796696')]

In [30]:
# update data

# update
# set meaning change
# where


%%sql

UPDATE students
SET studentname = "David Foster Wallace"
WHERE email = "a@a.com";

 * sqlite:///students.db
3 rows affected.

[]

In [31]:
%%sql

select * from students;

 * sqlite:///students.db
Done.

[(3, 'David Foster Wallace', '555-1212', 'a@a.com', '1727796684'),
 (4, 'David Foster Wallace', '555-1212', 'a@a.com', '1727796687'),
 (5, 'David Foster Wallace', '555-1212', 'a@a.com', '1727796690'),
 (6, 'William Shakespeare', '555-1212', 'will@globe.uk.com', '1727796694'),
 (7, 'William Shakespeare', '555-1212', 'will@globe.uk.com', '1727796696')]

In [32]:
# delete whole table

%%sql

drop table students

 * sqlite:///students.db
Done.

[]

# Homework

1.  Create a table.  Anything that is interesting.  Like for example, people on your football team.  Of members of your family.

* name
* age
* favorite food

2.  Do all the commands I did above.  So add them, search for them, delete them.